// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12


Console.WriteLine("Введите число");
int a = int.Parse(Console.ReadLine());
int sumDigit(int num)
{
    int sum = 0;
    while (num > 0)
    {
        sum = sum + num % 10;
        num = num / 10;
    }
    return sum;
}
int result = sumDigit(a);
Console.WriteLine($"{result}");

// Console.WriteLine($"{a % 10}");
